app/views/resultados/index.xls.erb

SELECT "resultados".* FROM "resultados" WHERE "resultados"."fichero_id" = ?  [["fichero_id", 93]]
---
  </tr>
  <% @resultados = Resultado.where(:fichero_id => session[:fichero_id])%>

SELECT  "estandars".* FROM "estandars" WHERE "estandars"."id" = ? LIMIT 1  [["id", 1]]
---
    <td><%= result.id %></td>
    <td><%= Estandar.find(result.estandar_id).tipo %></td>