app/views/resultados/index.html.erb

      <% mis_estandares.each do |mi_estandar| %>
      <% resultado_bad = Resultado.where(:estandar_id => mi_estandar.id, :codError=>1).count%>
---
SELECT "resultados".* FROM "resultados" WHERE "resultados"."estandar_id" = ? AND "resultados"."codError" = ?  [["estandar_id", 1], ["codError", 1]]
SELECT COUNT(*) FROM "resultados" WHERE "resultados"."estandar_id" = ? AND "resultados"."codError" = ?  [["estandar_id", 1], ["codError", 1]]