app/views/resultados/index.html.erb


 <% mis_estandares = Estandar.all%>
---
SELECT "estandars".* FROM "estandars"

      <% mis_estandares.each do |mi_estandar| %>
       <% resultado_bad = Resultado.where(:fichero_id => session[:fichero_id], :estandar_id => mi_estandar.id, :codError=>1).count%>
---
SELECT "resultados".* FROM "resultados" WHERE "resultados"."fichero_id" = ? AND "resultados"."estandar_id" = ? AND "resultados"."codError" = ?  [["fichero_id", 37], ["estandar_id", 1], ["codError", 1]]
SELECT COUNT(*) FROM "resultados" WHERE (fichero_id = 89 AND  estandar_id NOT IN (SELECT "resultados".* FROM "resultados" WHERE "resultados"."fichero_id" = 89 AND "resultados"."codError" = 1 GROUP BY "resultados"."estandar_id") AND codError = 0)

            <% mis_resultados.each do |res| %>
            <% mi_fichero = Fichero.find_by(id: session[:fichero_id])%>
---
SELECT  "ficheros".* FROM "ficheros" WHERE "ficheros"."id" = ? LIMIT 1  [["id", 21]]