app/controllers/archivos_controller.rb

  def subir_archivos
     @formato_erroneo = false;
  if request.post?
     #Archivo subido por el usuario.
     archivo = params[:archivo];
     #Nombre original del archivo.
     nombre = archivo.original_filename;
     @nombrefile = archivo.original_filename;
     #Directorio donde se va a guardar.
     directorio = Ruta_directorio_archivos;
     #Extensión del archivo.
     extension = nombre.slice(nombre.rindex("."), nombre.length).downcase;
     #Verifica que el archivo tenga una extensión correcta.
     if extension == ".xml"
        #Ruta del archivo.
        path = File.join(directorio, nombre);
        #Crear en el archivo en el directorio. Guardamos el resultado en una variable, será true si el archivo se ha guardado correctamente.
        resultado = File.open(path, "wb") { |f| f.write(archivo.read) };
        #Verifica si el archivo se subió correctamente.
        if resultado
           subir_archivo = "ok";

           # Creacion del Fichero
          @fichero = Fichero.new
          @fichero.nombre = @nombrefile
          @fichero.created_at = Time.zone.today
---
INSERT INTO "ficheros" ("nombre", "fecha_crea", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Presentación_totaltiposLetra.xml"], ["fecha_crea", "2017-03-15 00:00:00.000000"], ["created_at", "2017-03-15 18:03:12.686314"], ["updated_at", "2017-03-15 18:03:12.686314"]]



            # def estadar_tip1_fuente   .attr('typeface')
            @estadr = Estandar.find_by(id:1)
---
SELECT  "estandars".* FROM "estandars" WHERE "estandars"."id" = ? LIMIT 1  [["id", 1]]

               else
                 @resultado.codError = 0
               end
               @resultado.save
---
INSERT INTO "resultados" ("fichero_id", "estandar_id", "codError", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["fichero_id", 21], ["estandar_id", 1], ["codError", 0], ["created_at", "2017-03-15 19:59:27.026696"], ["updated_at", "2017-03-15 19:59:27.026696"]]