app/controllers/ficheros_controller.rb

SELECT "ficheros".* FROM "ficheros"
---
  def index
    @ficheros = Fichero.all

DELETE FROM "ficheros" WHERE "ficheros"."id" = ?  [["id", 1]]
---
  def destroy
    @fichero.destroy

SELECT  "ficheros".* FROM "ficheros" WHERE "ficheros"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_fichero
      @fichero = Fichero.find(params[:id])