app/controllers/resultados_controller.rb

SELECT "resultados".* FROM "resultados" WHERE (fichero_id = 89 AND  estandar_id NOT IN (2,3) AND codError = 0) GROUP BY "resultados"."estandar_id"
---
  def index
    @resultados = Resultado.order(:estandar_id)