app/controllers/resultados_controller.rb

  def index
    @resultados = Resultado.all
---
SELECT "resultados".* FROM "resultados"